[
  {
    "key": "618bab88a450c3bd75115c9c",
    "rate": 5,
    "name": "Shashwat Kumar",
    "review": "Ordered Brass wall light from Handicraft. Happy and satisfied with the quality of the product. The carvings made are really impressive and the conical lattice shape gives it a majestic look."
  },
  {
    "key": "618bab88d682cfe57769cdde",
    "rate": 5,
    "name": "Anto Pereira",
    "review": "I wandered in the store and found many items I liked & also developed a great conversation with the team, friendly place where collapsing & positive energy radiates throughout the store. Thank you for the excellent customer service!!"
  },
  {
    "key": "618bab880267128c7ecc06d2",
    "rate": 5,
    "name": "Ramesh Rao",
    "review": " Handicraft has some great collection & really awesome customer service. One of the finest stores in the country I have been to. "
  },
  {
    "key": "618bab888df7ad10b9610ac6",
    "rate": 5,
    "name": "Siddhi Agarwal",
    "review": "I bought this beautiful Nari planter and hand-beaten tea set. The package arrived neatly wrapped and well in time. The products look fab and am mightily impressed by the seamlessness of the ordering process."
  },
  {
    "key": "618bab88e518620f6a121fce",
    "rate": 4,
    "name": "Shashank Singh",
    "review": "I was looking for something rustic to go along with my living room interiors when I came across this website. Some of the products have a lovely handicraft vibe to them. So I ordered a clock and some pottery and was really impressed with the packaging. That’s not the best part, I later discovered that the products came directly from a village made by craftsmen of the third generation. It’s a lovely way to support artisans and their families."
  },
  {
    "key": "618bab8809a13a2e69cfad95",
    "rate": 5,
    "name": "Nitesh Shrothi",
    "review": "Ordered a wind chime. Liked the quality of material and designing. Received a lovely letter from Handicraft as well. Looking forward to getting some more. Cheers."
  }
]
